In [1]:
import pandas as pd

In [6]:
s = pd.Series([10000, 20000, 30000, 40000], index=['서울', '부산', '대구', '광주'])
s

서울    10000
부산    20000
대구    30000
광주    40000
dtype: int64

In [7]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [8]:
s.index

Index(['서울', '부산', '대구', '광주'], dtype='object')

In [9]:
s.values

array([10000, 20000, 30000, 40000], dtype=int64)

In [10]:
s / 100

서울    100.0
부산    200.0
대구    300.0
광주    400.0
dtype: float64

In [14]:
s[3]

40000

In [15]:
s['부산']

20000

In [16]:
s[[2,0,1]]

대구    30000
서울    10000
부산    20000
dtype: int64

In [19]:
s[(10000 < s) & ( s < 30000)] #and는 안되고, &를 써야해

부산    20000
dtype: int64

In [20]:
s[0:2]

서울    10000
부산    20000
dtype: int64

In [21]:
s['서울':'대구'] #슬라이싱과는 달리 마지막 인덱스도 출력이 된다.

서울    10000
부산    20000
대구    30000
dtype: int64

In [24]:
s0 = pd.Series(range(3), index = ['a', 'b', 'c'])
s0

a    0
b    1
c    2
dtype: int64

In [25]:
s0.a #인덱스의 라벨값이 영문일 경우 .a .b .c로 값을 불러올 수 있다.

0

In [26]:
'서울' in s #서울이 s의 인덱스 라벨 중에 있니?

True

In [27]:
'울산' in s

False

In [32]:
for a, b in s.items():
    print('%s = %d' % (a,b))  # %s는 문자열, %d는 정수, %f는 실수형 서식 지정자

서울 = 10000
부산 = 20000
대구 = 30000
광주 = 40000

In [34]:
s2 = pd.Series({'서울': 963812, '부산':357821, '인천':225987, '대전':335210})
s2

서울    963812
부산    357821
인천    225987
대전    335210
dtype: int64

In [39]:
s2 = pd.Series({'서울': 963812, '부산':357821, '인천':225987, '대전':335210}, index = ['부산', '대전', '인천', '서울']) #index 값을 넣어 순서를 정해준다.
s2

부산    357821
대전    335210
인천    225987
서울    963812
dtype: int64

In [41]:
s

서울    10000
부산    20000
대구    30000
광주    40000
dtype: int64

In [40]:
ds = s - s2
ds

광주         NaN
대구         NaN
대전         NaN
부산   -337821.0
서울   -953812.0
인천         NaN
dtype: float64

In [42]:
s.values - s2.values #index값 상관안하고 value 값끼리 연산

array([-347821, -315210, -195987, -923812], dtype=int64)

In [43]:
ds.notnull() #값이 NAN이 아닌지 묻는 매서드

광주    False
대구    False
대전    False
부산     True
서울     True
인천    False
dtype: bool

In [44]:
ds[ds.notnull()] #ds 중에 notnull이 True인 애들의 값만

부산   -337821.0
서울   -953812.0
dtype: float64

In [55]:
rs = (s - s2) / s2 * 100 #인구증가율 계산
rs = rs[rs.notnull()]
rs

부산   -94.410613
서울   -98.962453
dtype: float64

In [57]:
rs[1] = 100 #인덱싱을 이용해서 데이터를 갱신하거나 추가할 수 있다.
rs

부산    -94.410613
서울    100.000000
dtype: float64

In [58]:
rs['부산'] = 1000 #숫자와 문자열 모두 가능하다.
rs

부산    1000.0
서울     100.0
dtype: float64

In [60]:
del rs['서울'] #del 명령으로 데이터 삭제도 가능하다.
rs

부산    1000.0
dtype: float64

In [61]:
rs['대구'] = 1000 #인덱싱을 이용해서 없던 데이터를 추가할 수 있다.
rs

부산    1000.0
대구    1000.0
dtype: float64

In [63]:
a = pd.Series([1000, 2000, 3000, 4000, 5000, 6000], index=['서울', '부산', '광주', '인천', '대구', '대전'])
b = pd.Series([1111, 2222, 3033, 4025, 5080, 6120], index=['전주', '청주', '광주', '인천', '포항', '강릉'])

In [66]:
c = a + b
c

강릉       NaN
광주    6033.0
대구       NaN
대전       NaN
부산       NaN
서울       NaN
인천    8025.0
전주       NaN
청주       NaN
포항       NaN
dtype: float64

In [68]:
c[c.notnull()]

광주    6033.0
인천    8025.0
dtype: float64

In [72]:
data = {
    '2015' : [900506, 930523, 870802, 830807],
    '2017' : [900210, 880807, 875610, 780523],
    '지역' : ['수도권', '경상권', '수도권', '경상권'],
    '2015-2017 증가율' : [0.283, 0.789, 0.987, 0.534]
}
columns = ['지역', '2015', '2017', '2015-2017 증가율']
index = ['서울', '부산', '인천', '대구']
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역    2015    2017  2015-2017 증가율
서울  수도권  900506  900210          0.283
부산  경상권  930523  880807          0.789
인천  수도권  870802  875610          0.987
대구  경상권  830807  780523          0.534

In [73]:
df.values

array([['수도권', 900506, 900210, 0.283],
       ['경상권', 930523, 880807, 0.789],
       ['수도권', 870802, 875610, 0.987],
       ['경상권', 830807, 780523, 0.534]], dtype=object)

In [74]:
df.columns

Index(['지역', '2015', '2017', '2015-2017 증가율'], dtype='object')

In [76]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [77]:
df.index.name = '도시'
df

     지역    2015    2017  2015-2017 증가율
도시
서울  수도권  900506  900210          0.283
부산  경상권  930523  880807          0.789
인천  수도권  870802  875610          0.987
대구  경상권  830807  780523          0.534

In [78]:
df.columns.name = '특성'
df

특성   지역    2015    2017  2015-2017 증가율
도시
서울  수도권  900506  900210          0.283
부산  경상권  930523  880807          0.789
인천  수도권  870802  875610          0.987
대구  경상권  830807  780523          0.534

In [79]:
df['2015-2017 증가율'] = df['2015-2017 증가율'] * 100
df

특성   지역    2015    2017  2015-2017 증가율
도시
서울  수도권  900506  900210           28.3
부산  경상권  930523  880807           78.9
인천  수도권  870802  875610           98.7
대구  경상권  830807  780523           53.4

In [80]:
del df['2015-2017 증가율']
df

특성   지역    2015    2017
도시
서울  수도권  900506  900210
부산  경상권  930523  880807
인천  수도권  870802  875610
대구  경상권  830807  780523

In [85]:
df['2015 바보'] = (1, 2, 3, 4)
df

특성   지역    2015    2017  2015 바보
도시
서울  수도권  900506  900210        1
부산  경상권  930523  880807        2
인천  수도권  870802  875610        3
대구  경상권  830807  780523        4

In [87]:
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [94]:
df['2017'] #[]은 시리즈 자료형으로 변환한다.

도시
서울    900210
부산    880807
인천    875610
대구    780523
Name: 2017, dtype: int64

In [95]:
df[['2017']] #[[]] 해야 데이터프레임이 유지된다.

특성    2017
도시
서울  900210
부산  880807
인천  875610
대구  780523

In [96]:
type(df[["2017"]])

pandas.core.frame.DataFrame

In [97]:
type(df['2017'])

pandas.core.series.Series

In [99]:
df[0:3]

특성   지역    2015    2017  2015 바보
도시
서울  수도권  900506  900210        1
부산  경상권  930523  880807        2
인천  수도권  870802  875610        3

In [100]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [101]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [102]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample2.csv

In [103]:
pd.read_csv('sample2.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [104]:
pd.read_csv('sample1.csv', index_col='c1') #테이블 내의 특정한 열을 행 인덱스로 지정하고 싶을 땐, index_col = 을 써주세요~

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [109]:
%%writefile sample3.txt
c1          c2            c3
0.171717 0.2828288 0.373635
0.118273 0.9847523 0.482933

Writing sample3.txt

In [111]:
pd.read_table('sample3.txt', sep='\s+') # sep = '\s+' 길이가 정해지지 않은 공백이 구분자일 경우, 쓰는 정규식 문자열

         c1        c2        c3
0  0.171717  0.282829  0.373635
1  0.118273  0.984752  0.482933

In [114]:
pd.read_table('sample3.txt', skiprows=[0]) #자료 중에 건너야 할 행이 있으면 skiprows=[행의 위치값] 을 써준다.

Empty DataFrame
Columns: [0.118273 0.9847523 0.482933]
Index: []